# UngroupMembers Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Group..::..UngroupMembers Method
Group Class See Also
---
Ungroups the group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ICollection<ElementId> UngroupMembers()
```

Visual Basic
---
```text
Public Function UngroupMembers As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ UngroupMembers()
```

# ### Return Value
If successful, the ids of the members of group are returned.
# Remarks
Removes all the members from the group and deletes the group. Note that the reference to this group object will become invalid once this method is called.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if the group cannot be ungrouped. |

# See Also
Group Class
Autodesk.Revit.DB Namespace